Revit 2026 API

# ScheduleVerticalAlignment Enumeration

---

Vertical alignment of data in a schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScheduleVerticalAlignment
```
```vb
Public Enumeration ScheduleVerticalAlignment
```
```cpp
public enum class ScheduleVerticalAlignment
```
```fsharp
type ScheduleVerticalAlignment
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 2 | Bottom aligned |
| Middle | 1 | Middle aligned |
| Top | 0 | Top aligned |

#### Reference

Autodesk.Revit.DB Namespace